src/CF/Catalogs/ВидыСредствПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ВидыСредствПредприятия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адресный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезНанесенияИнвентарныхНомеров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСредстваТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСредствТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одноразовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроДополнительныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1020</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Enums/ТипыДополнительныхРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыДополнительныхРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СсылкаНаЭлементСправочника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеИзСправочника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/ДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ДополнительныеРеквизиты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоРеквизитДляОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыДляДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбъектаВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДополнительногоРеквизита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКлючУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеПараметрыЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/ВидыСредствПредприятия/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// sza150714-0006 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001600", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИДобавитьРеквизитНоменклатуры(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПараметрыФормы = Новый Структура("ОбъектВладелец", Объект.Ссылка);	
		ФормаРеквизитаНоменклатурнойГруппы = ПолучитьФорму("Справочник.ДополнительныеРеквизиты.Форма.ФормаЭлемента", ПараметрыФормы);
		ФормаРеквизитаНоменклатурнойГруппы.ОткрытьМодально();
		НовыйРеквизит = ФормаРеквизитаНоменклатурнойГруппы.Объект.ссылка;
		Если ЗначениеЗаполнено(НовыйРеквизит) Тогда
			ДобавитьНовыйРеквизит(НовыйРеквизит);
		КонецЕсли;	    
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыйРеквизит(Знач НовыйРеквизит) 	
	
	НОвыйРеквизитСтрока = Объект.ДополнительныеРеквизиты.Добавить();
	НОвыйРеквизитСтрока.ДополнительныйРеквизит  = НовыйРеквизит;
	НОвыйРеквизитСтрока.ЗначениеПоУмолчанию 	= ОбщийМодульПовтор.ПолучитьПустоеЗначениеДополнительногоРеквизита(НовыйРеквизит, ИСТИНА);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыДополнительныйРеквизитПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	СтрокаТаблицы.ЗначениеПоУмолчанию = ОбщийМодульПовтор.ПолучитьПустоеЗначениеДополнительногоРеквизита(СтрокаТаблицы.ДополнительныйРеквизит, ИСТИНА);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Объект.ДополнительныеРеквизиты.Количество() > 9;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДополнительныеРеквизиты.ТекущиеДанные;
	ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(ТекущиеДанные.ДополнительныйРеквизит, "ТипДополнительногоРеквизита");
	
	Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника") Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		
		Если ТекущиеДанные.ЗначениеПоУмолчанию = Неопределено Тогда
			ТипРеквизита = Неопределено;

			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораЗавершение1", ЭтаФорма, Новый Структура("ТекущиеДанные, ТипДополнительногоРеквизита", ТекущиеДанные, ТипДополнительногоРеквизита)), ОбщийМодульКлиент.ПолучитьСписокИзМетаданных(ИСТИНА));
            Возврат;
		КонецЕсли;
		ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораФрагмент1(ТекущиеДанные);
		
	ИначеЕсли ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		
		Если ТекущиеДанные.ЗначениеПоУмолчанию = Неопределено Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("ТекущиеДанные", ТекущиеДанные)), ОбщийМодульКлиент.ПолучитьСписокИзМетаданных(ЛОЖЬ));
            Возврат;
		КонецЕсли;
		ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораФрагмент(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораЗавершение1(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	ТипДополнительногоРеквизита = ДополнительныеПараметры.ТипДополнительногоРеквизита;	
	
	ТипРеквизита = ВыбранныйЭлемент;
	Если НЕ ТипРеквизита = Неопределено Тогда
		ТекущиеДанные.ЗначениеПоУмолчанию = ПредопределенноеЗначение("Справочник." + ТипРеквизита.Значение + ".ПустаяСсылка");	
	КонецЕсли;
	
	ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораФрагмент1(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораФрагмент1(Знач ТекущиеДанные)
	
	ПоказатьВводЗначения(Неопределено, ТекущиеДанные.ЗначениеПоУмолчанию, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ": ");

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;	
	
	ТипРеквизита = ВыбранныйЭлемент;
	Если НЕ ТипРеквизита = Неопределено Тогда
		ТекущиеДанные.ЗначениеПоУмолчанию = ПредопределенноеЗначение("Документ." + ТипРеквизита.Значение + ".ПустаяСсылка");	
	КонецЕсли;
	
	ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораФрагмент(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыЗначениеПоУмолчаниюНачалоВыбораФрагмент(Знач ТекущиеДанные)
	
	ПоказатьВводЗначения(Неопределено, ТекущиеДанные.ЗначениеПоУмолчанию, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ": ");

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыЗначениеПоУмолчаниюОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.РеквизитыНоменклатуры.ТекущиеДанные;
	ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(ТекущиеДанные.ДополнительныйРеквизит, "ТипДополнительногоРеквизита");
	
	Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника")
		ИЛИ ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		
		ТекущиеДанные.ЗначениеПоУмолчанию = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
